rus_lower = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'

for position in range(11):
    print('*' * 27)
    for letter in rus_lower:
        if rus_lower.index(letter) % 11 == position:
            print('| ', letter.upper(), letter, ' |', end='')
    print()
print('*' * 27)


# ***************************
# |  А а  ||  К к  ||  Х х  |
# ***************************
# |  Б б  ||  Л л  ||  Ц ц  |
# ***************************
# |  В в  ||  М м  ||  Ч ч  |
# ***************************
# |  Г г  ||  Н н  ||  Ш ш  |
# ***************************
# |  Д д  ||  О о  ||  Щ щ  |
# ***************************
# |  Е е  ||  П п  ||  Ъ ъ  |
# ***************************
# |  Ё ё  ||  Р р  ||  Ы ы  |
# ***************************
# |  Ж ж  ||  С с  ||  Ь ь  |
# ***************************
# |  З з  ||  Т т  ||  Э э  |
# ***************************
# |  И и  ||  У у  ||  Ю ю  |
# ***************************
# |  Й й  ||  Ф ф  ||  Я я  |
# ***************************