https://www.w3schools.com/python/python_for_loops.asp
https://www.w3schools.com/python/python_while_loops.asp

- Даны целые числа, вывести четные они или нет

- Определить, вискосный ли год
как вычислять:
https://learn.microsoft.com/ru-ru/office/troubleshoot/excel/determine-a-leap-year
https://calculator888.ru/visokosnyy-god
Високосный год делится без остатка на 4, за исключением столетий (года заканчивающиеся на 00). Столетние года,
мы будем делить на 400, если делится без остатка, то этот год является високосным. 

- вывести все простые числа в интервале

- вычислить факториал числа

- вывести таблицу умножения

- задан словарь dt = {'a': 'Фрукты', 'b': 'Яблоки', 'c': 'Груши'}
    вывести значения ключей и значений


- На вход функция more_than_five(lst) получает список из целых чисел. 
Результатом работы функции должен стать новый список, в котором содержатся только те числа, которые больше 5 по модулю.
```
def more_than_five(lst):
	new_lst = []
	for number in lst:
    	if abs(number) > 5:
        	new_lst.append(number)
	return new_lst

print(more_than_five([-11, 4, -2, 90, 400, 0, -5]))
print(more_than_five([-2, 2, 3, 4, 0, -1]))
print(more_than_five([70, -900, 41, 0]))
```

- Есть строка, состоящая из русских букв разных регистров, необходимо почистить от заглавных литер. 
Как ему показалось, он написал верный код, но результат совсем не порадовал. 
Ниже представлен пример работы «чистильщика строк», которому срочно требуется ваша помощь.
https://www.w3schools.com/python/python_strings_methods.asp

```
letters = 'ЫгВЫоЯСремДШНККАыкЩЙФа'

for letter in letters:
	if letter.upper() = letters:
		letters.replace(letter, '')

print(letters)
```

- Напишите программу, в которой в бексонечном цикле пользователь вводит два числа, а программа выводит их сумму.
Затем программа запрашивает, надо ли завершить ввод. И если пользователь вводит букву "Y" или "y", то происходит выход
из бесконечного цикла, и программа завершается. При нажатии любой другой клавиши, программа продолжает работу. 

- Дан секретный список ников, предлагается ввести ник, если он в спсике, выдается приветсвенное сообщение "Ты свой, заходи,"
если нет - то выдается сообщение "Не знаю тебя" и цикл завершается
[list.py](list.py)
secret_list = ['Мавпродош', 'Лорнектиф', 'Древерол', 'Фиригарпиг', 'Клодобродыч']

- Используйте циклы, чтобы вывести на консоль следующую фигуру:

*******
 *   * 
  * *  
   *   
  * *  
 *   * 
*******
```
n = 7
for i in range(0, n): 
    for j in range(0, n): 
        if(i == 0 or i == n-1 or j==i or j == n-i-1): print("*", end="")
        else: print(" ", end="")
    print()
```

- Используйте циклы, чтобы вывести на консоль следующий набор символов:

*  1  *  2  * 
3  *  4  *  5 
*  6  *  7  * 
8  *  9  *  10 
*  11 * 12  *  

```
n=5
k=1
counter=1
for i in range(n):
    for j in range(n):
        if k % 2 == 0:
            print(counter, end ="  ")
            counter+=1
        else: print("*",end="  ")
        k+=1     
    print()
```



- Есть строка алфавита: абвгдеёжзийклмнопрстуфхцчшщъыьэюя
Необходимо вывести в красивом формате как представлено ниже
В строке 27 символов ^
- 
Пусть 𝑎 и 𝑏 — целые числа, причём 𝑏≠0.
Деление с остатком 𝑎(«делимого») на 𝑏(«делитель») означает нахождение таких целых чисел 𝑞 и 𝑟, что выполняется равенство:
a=b*q+r

^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  А а  ||  К к  ||  Х х  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Б б  ||  Л л  ||  Ц ц  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  В в  ||  М м  ||  Ч ч  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Г г  ||  Н н  ||  Ш ш  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Д д  ||  О о  ||  Щ щ  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Е е  ||  П п  ||  Ъ ъ  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Ё ё  ||  Р р  ||  Ы ы  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Ж ж  ||  С с  ||  Ь ь  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  З з  ||  Т т  ||  Э э  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  И и  ||  У у  ||  Ю ю  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
|  Й й  ||  Ф ф  ||  Я я  |
^^^^^^^^^^^^^^^^^^^^^^^^^^^
```
rus_lower = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
for position in range(11):
    print('^' * 27)
    for letter in rus_lower:
        if rus_lower.index(letter) % 11 == position:
            print('| ', letter.upper(), letter, ' |', end='')
    print()
print('^' * 27)
```

Вывести последовательность Фибоначчи с помощью цикла while.
Последовательность Фибоначчи — это целочисленная последовательность, где следующая цифра равна сумме двух предыдущих.
Пример n-ый член последовательности, это сумма (n-1) и (n-2), выглядит это следующим образом: 0,1,1,2,3,5,8,13….
```
nterms = int(input("Количество последовательностей "))

# первые две последовательности
n1, n2 = 0, 1
count = 0

print("Последовательность Фибоначчи:")
while count < nterms:
    print(n1)
    nth = n1 + n2
    # Обновляем значения
    n1 = n2
    n2 = nth
    count += 1
```